updated README.md file and blocked screenshot taking
